БухЭксп/InformationRegisters/CW_ШаблоныДокументовПраваДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ШаблоныДокументовПраваДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РедактированиеОбщегоШаблона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РедактированиеШаблонаДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РедактированиеМакросовШаблона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ШаблоныДокументовПраваДоступа/Ext/ManagerModule.bsl
Функция ПолучитьПраваДостпаГруппыПользователей(ГруппаПользователя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ШаблоныДокументовПраваДоступа.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных,
	               |	CW_ШаблоныДокументовПраваДоступа.РедактированиеШаблонаДокумента КАК РедактированиеШаблонаДокумента,
	               |	CW_ШаблоныДокументовПраваДоступа.РедактированиеОбщегоШаблона КАК РедактированиеОбщегоШаблона,
	               |	CW_ШаблоныДокументовПраваДоступа.РедактированиеМакросовШаблона КАК РедактированиеМакросовШаблона
	               |ИЗ
	               |	РегистрСведений.CW_ШаблоныДокументовПраваДоступа КАК CW_ШаблоныДокументовПраваДоступа
	               |ГДЕ
	               |	CW_ШаблоныДокументовПраваДоступа.ГруппаПользователя = &ГруппаПользователя";   
	
	Запрос.УстановитьПараметр("ГруппаПользователя", ГруппаПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции   

Функция ПолучитьПравоДостпаГруппыПользователя(ГруппаПользователя, НазначениеШаблона) Экспорт
	
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ШаблоныДокументовПраваДоступа.ИдентификаторОбъектаМетаданных КАК ИдентификаторОбъектаМетаданных,
	               |	CW_ШаблоныДокументовПраваДоступа.РедактированиеШаблонаДокумента КАК РедактированиеШаблонаДокумента,
	               |	CW_ШаблоныДокументовПраваДоступа.РедактированиеОбщегоШаблона КАК РедактированиеОбщегоШаблона,
	               |	CW_ШаблоныДокументовПраваДоступа.РедактированиеМакросовШаблона КАК РедактированиеМакросовШаблона
	               |ИЗ
	               |	РегистрСведений.CW_ШаблоныДокументовПраваДоступа КАК CW_ШаблоныДокументовПраваДоступа
	               |ГДЕ
	               |	CW_ШаблоныДокументовПраваДоступа.ГруппаПользователя = &ГруппаПользователя
	               |	И CW_ШаблоныДокументовПраваДоступа.ИдентификаторОбъектаМетаданных = &НазначениеШаблона";   
	
	Запрос.УстановитьПараметр("ГруппаПользователя", ГруппаПользователя);
	Запрос.УстановитьПараметр("НазначениеШаблона", 	НазначениеШаблона);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Соответствие.Вставить(Тип("СправочникСсылка.CW_ОбщиеШаблоныДокументов"), 	Выборка.РедактированиеОбщегоШаблона);
		Соответствие.Вставить(Тип("СправочникСсылка.CW_ШаблоныДокументов"), 		Выборка.РедактированиеШаблонаДокумента); 
		Соответствие.Вставить(Тип("СправочникСсылка.CW_МакросыШаблоновДокументов"), Выборка.РедактированиеМакросовШаблона); 
	КонецЕсли;
	
	Возврат Соответствие;
	
КонецФункции
